# 07_제어문 (조건문)

# 조건문

# ==============================
# 기본형식
# ==============================

a = 5
if a > 4:
    print('4 초과')
else:
    print('4 이하')
# 4 초과

a = 2
if a > 4:
    print('4 초과')
else:
    print('4 이하')
# 4 이하

# 기본형식 실습

num = int(input('숫자 : '))

if num % 2 == 0:
	print('짝수')
else:
	print('홀수')

# if num % 2:  # if num % 2 == 1:

# ==============================
# 복수 조건문
# ==============================

age = 10
if age >= 20:
    print('성인')
elif age >= 17:
    print('고등학생')
elif age >= 14:
    print('중학생')
elif age >= 8:
    print('초등학생')
else:
    print('미취학 아동')
print('입니다.')

'''
초등학생
입니다.
'''
# 조건식은 순차적 비교

# ==============================
# 중첩 조건문
# ==============================

age = 40
if age >= 20:
    print('성인')
    if age >= 30:
        print('보험에 가입하세요.')
elif age >= 17:
    print('고등학생')
elif age >= 14:
    print('중학생')
elif age >= 8:
    print('초등학생')
else:
    print('미취학 아동')

'''
성인
보험에 가입하세요.
'''

# ==============================
# 조건 표현식
# ==============================

num = -10
vaule = num if num >=0 else -num
print(vaule) # 10